---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarHandleType.OutOfPlaneExtent
enum: Autodesk.Revit.DB.Structure.RebarHandleType
source: html/0773859c-5f30-3fb4-25b3-34c80432aaa4.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleType.OutOfPlaneExtent

Handle controlling the extent of a three-dimensional Rebar out of
 its primary plane. This includes the length of a Rebar Set, the
 out-of-plane length of a multi-planar Rebar, and the length of a
 spiral Rebar.